---
kind: method
id: M:Autodesk.Revit.DB.ExportPatternKey.#ctor
source: html/4c6a5f30-3c1e-b8ef-774e-0b0685e3033d.htm
---
# Autodesk.Revit.DB.ExportPatternKey.#ctor Method

Constructs a new default ExportPatternKey.

## Syntax (C#)
```csharp
public ExportPatternKey()
```